[
    {
        "Title": "Workplace wellbeing: Making strides in our profession",
        "Description": "Workplace wellbeing: Making strides in our profession",
        "Content":"In my inaugural column last August, I wrote about how meeting the demands of our profession,living life, and managing a family can strain our wellbeing. As your AVMA president, building a culture f wellbeing, diversity, inclusion, and belonging within the entire veterinary team remains a priority for me.There has been some promising progress in our work to improve mental health and wellbeing among our veterinary teams.This was shown in the latest Veterinary Wellbeing Study conducted by Merck Animal Health in collaboration with the AVMA.Results of the study indicate our efforts are resulting in healthier and more satisfying careers for veterinary teams.   The AVMA is committed to providing the veterinary profession with the tools and resources to help develop and maintain healthy individuals and teams.Updated tools to support wellbeing Late last year, the Association updated our workplace wellbeing certificate CE on AVMA Axon®, expanding it from one to two certificate programs. Workplace Wellbeing 1: Setting the Foundation now includes two new modules: “A New Era of Wellbeing at Work” and “The Intersection of Workplace Wellbeing and Conflict.” And a new certificate, Workplace Wellbeing 2: Self and Social Awareness, builds on key information and skills to provide a deep dive into three areas central to workplace wellbeing: self-awareness, social awareness, and conflict management. Both certificate programs are CE-eligible.One of the most critical ways to enhance wellbeing is to promote diversity, equity, and  inclusion (DEI). Organizations that give precedence to DEI play a vital role in protecting and enhancing the mental and emotional health of their employees. This is especially crucial in the veterinary profession, where we often face significant stressors such as high-pressure work environments, substantial emotional tolls, and a need for a sense of belonging.Save the date To help increase understanding of the vital intersection of DEI and enhancing wellbeing and emotional health, the AVMA will host the inaugural Diversity, Equity, Inclusion, and Wellbeing (DEIW) Summit November 7-9 in Atlanta. The event,designed for academicians and veterinary professionals, is aimed at influencing attendees' personal and professional  perspectives around DEIW and will consist of workshops, keynotes, panel discussions, and much more. Please save the date for this important summit. I found it personally and professionally rewarding to have participated in the AVMA's workplace wellbeing and Brave Space certificate programs and Journey for Teams modules. They have all helped me foster a healthier and more supportiveatmosphere in my workplace. I will now dedicate time to continuing my journey by taking advantage of the new programs to expand my ability to create a sense of unity and understanding in all aspects of my life and work.",
        "ImageUrl": "/Dr.Rena.jpg",
        "UserId": 1 
    },
    {
        "Title": "Comment now: Educational curriculum standards",
        "Description": "Comment now: Educational curriculum standards",
        "Content":"The AVMA Council on Education® (AVMA COE®) has proposed changes to its educational standard governing the     curriculum for veterinary medical schools and is accepting comment on the proposal through April 29, 2024.        Under the proposed change, all accredited veterinary schools would be required to “provide at least 130 weeks of instruction         that is directly supervised. Direct instruction must include a minimum of 40 weeks of hands-on clinical education involving       the prevention, diagnosis, treatment, and mitigation of disease related to animal health.”  The current standard requires “a period equivalent to a minimum of four academic years, including a minimum of one academic         year of hands-on clinical education.”The council explains the rationale for the proposed change this way: “Increasing variability in the calendar length of    veterinary educational programs requires standardization of requirements in terms of weeks of instruction to ensure students are able to participate fully in the didactic, required, and elective education necessary for their development. " ,"ImageUrl": "/HERO-2880x900-COEEvents.jpg",
        "UserId": 2 
    },
    {
        "Title": "Just one thing: Support practice health by reflecting on Q1",
        "Description": "Comment now: Educational curriculum standards",
        "Content":"High production and productivity support veterinary practice health. But where can we start identifying    opportunities to maximize these measures? An outcomes-oriented approach, focusing on revenues, can provide valuable insights.    With the first quarter of the year just wrapped up, now is a perfect time to take stock and seek to identify financial        trends in your practice. There’s ample time for deliberate action and adjustments through the remainder of 2024.   Here’s a quick way to start        A first step is to examine your revenue breakdown, stratified by source. This can be tackled in 15 minutes or less:  Use your practice management software or a recent profit-and-loss or income statement to obtain a snapshot of revenues         over a certain period, such as the first quarter of 2024.         Identify revenue per category (e.g., vaccine, exam, dentistry, laboratory, imaging, and pharmacy). Take the revenue earned within each category, and divide it by gross revenue to arrive at the percentage of gross revenue    for each. Some software programs will do this for you automatically.Compare your results against industry benchmarks to highlight those revenue sources that are above or below average.     For example: Consider a companion animal practice that generated $250,000 of gross revenue over the first quarter, of which $6, 750 came from dentistry. By dividing this revenue by total gross revenue, we find that dentistry accounted for 2.7% of the practice’s total. To compare against an industry benchmark, look to the 2023 AVMA Report on the Economic State of the Veterinary Profession.         It shows that the average companion animal practice generated 6.4% of revenue from dentistry. Applying this percentage to the $250,000 in gross revenue for our example practice produces a possible revenue target for dentistry of $16,  000—$9,  500  more than actually achieved in Q1 and a clear opportunity for growth. After you’ve identified which revenue source(s) could be targeted for improvement, talk to your team about your findings, and discuss ways to boost revenue and productivity with your existing resources. In the dentistry example, this might    include process changes to allow more dental procedures to be performed within a given period and a social media campaign to promote the importance of routine dental scaling. Another resource that can streamline your assessment is the AAHA/VMG Chart of Accounts. This applies best-practice accounting standards for classifying revenue, so you can more easily organize your finances to compare against industry standards.  It’s worth remembering that every veterinary practice is unique. Revenues will vary with practice, client and patient characteristics; time of year; market demand; and other factors. Because you and your team know your practice best, you can      best assess which of the potential areas of improvement this assessment has identified represent your real opportunities for growth. " ,"ImageUrl": "/HERO2880x900-AWJAC.jpg",
        "UserId": 3 
    },
    {
        "Title": "A unique opportunity: Boost your animal welfare acumen",
        "Description": "A unique opportunity: Boost your animal welfare acumen",
        "Content":"Hone your understanding of animal welfare principles, along with your critical thinking and assessment skills,         at AVMA’s spring virtual Animal Welfare Assessment Contest®, coming up this April.        This one-of-a-kind event will take place online Saturday-Sunday, April 20-21, 2024. AVMA members can sign up to participate        for just $40 and will be eligible to receive CE credit. Veterinary technicians who are members of the National Association         of Veterinary Technicians in American (NAVTA) also can take part.The Animal Welfare Assessment Contest—also known as AWJAC—is a unique event that helps both students and veterinary         professionals explore the intricacies of welfare issues that affect animals used for human purposes—including agriculture,   research, and companionship. Participants compare similar scenarios involving animals to determine which scenario better  supports and protects the animals’ welfare, then present their findings to an expert judge.Students compete in four divisions: veterinary, graduate, undergraduate senior, and undergraduate junior. Veterinarians         and veterinary technicians don't compete for awards, but are otherwise full participants—evaluating the scenarios,presenting oral assessments, and receiving scores.         The April event will feature one scenario per day. In each case, participants will assess welfare as it pertains to all aspects of the animals’ lives, including transport, housing, health, production, and more. Presentations on housing system management and animal welfare of sows, laying hens, breeding dogs, and laboratory         mice will be offered each day following the scenario and assessments.          Learn more, see the tentative schedule, view past scenarios, and register online at awjac.org. Registration closes         April 10. "      ,
        "ImageUrl": "/mcm-just-one-thing-banner-v3-2880x900.jpg",
        "UserId": 4 
    },
    {
        "Title": "AVMA Convention: Earvin “Magic” Johnson is in the house",
        "Description":"Basketball legend and entrepreneur Earvin “Magic” Johnson will deliver the keynote address at AVMA Convention2024 this summer in Austin, Texas. Open to all Convention attendees, it will    be a once-in-a-lifetime opportunity to hear and be inspired by the Hall of Famer.      Headshot of Earvin 'Magic' Johnson      One of the greatest NBA players of all time, Johnson is now chairman and chief       executive officer of Magic Johnson Enterprises, an investment conglomerate that       provides high-quality products and services that focus primarily on ethnically diverse and underserved urban communities.          Hear how he transferred the skills and tenacity he acquired on the basketball court into a winning formula in the business           arena.                This year’s AVMA Convention takes place June 21-25, 2024. The keynote address, sponsored by Hill’s, will happen on Saturday,         June 22, at 10 a.m. Central time.",
        "Content":"An opportunity to learn, connect, and be inspired, AVMA Convention brings together the whole veterinary community for world-class education, special events,         networking opportunities,         and camaraderie. Johnson is the latest addition to an all-star lineup of presenters and entertainers who         will be part of the event. Another highlight: Grammy award-winning country music duo Brothers Osborne          will headline the AVMA concert, treating attendees to the progressive blend of country and rock that           has made them six-time Country Music Association Vocal Duo of the Year and four-time Academy of Country          Music Duo of the Year.                The AVMA Convention always offers a chance to catch up with old friends, network with peers, and make new connections         that will last a lifetime. As any previous attendee will tell you, the experience will stay with you long after you          go home. From Food Festival Friday to the always popular Live Life, Love All party, the full lineup of special events          will keep you energized and entertained.               All of those fun events, of course, are in addition to more than 650 hours of high-quality continuing education (CE),         with learning opportunities that cater to every veterinary specialty and area of interest.          The full CE schedule is available online, so you can browse sessions and start planning your program today.             Save big with early-bird registration, going on now        There are many ways to make the Convention experience more affordable. Save more than $200 just by being an AVMA member,        and register by May 9 for an early-bird discount that knocks another $100 off the cost.              If you’re not already subscribed, sign up for AVMA's monthly Convention newsletter. You’ll receive the latest information         and event updates delivered straight to your inbox. "      ,
        "ImageUrl": "/cmp-atx-hero-2880x900-2024.jpg",
        "UserId": 5 
    },
    {
        "Title": "Live learning for your clients: Pets and mental health",
        "Description": "Social media event stems from AVMA partnership",
        "Content":"AVMA President Dr. Rena Carlson will help spread the word about the mental health benefits of pet ownership         during a live social media chat later this month.        Invite your clients to watch when Dr. Carlson and Gregory Scott Brown, MD, from the American Psychiatric Association (APA)         answer commonly asked questions from pet owners. The event takes place on YouTube Live on March 27, beginning at 11 a.m.         Central Time. We’ll also be sharing highlights from their conversation shortly afterward on Instagram. You can watch by         following us on YouTube or Instagram.                 The event is part of a monthlong partnership between the AVMA and APA to raise awareness of how pet ownership improves         people’s mental health. Using the hashtag #PawsForMentalHealth, both organizations are sharing information throughout         the month about the benefits of the human-animal bond.                How pets support their owners' mental health        The campaign kicked off with the release of a survey quantifying some of those mental health benefits. Among the findings: 84% of owners said their pets have a mostly positive impact on their mental health.        62% said their pets provide a calming presence.        62% said their pets help reduce stress and anxiety.        65% consider their pets true friends (65%).        The APA has created a social media toolkit to make it easy to spread the word about the  #PawsForMentalHealth campaign.         The kit includes ready-to-use graphics, Facebook/Instagram filters, and sample social media posts.                 Pet owners can join the fun by sharing a photo of their favorite animal companion on social media with the hashtag         #Paws4MentalHealth and a message about how having a pet helps improve their mental health. ",
        "ImageUrl": "/Hero-2880x900-PetOwners.jpg",
        "UserId": 6 
    },
    {
        "Title": "Chart of the month: Connecting the cost of living and salary",
        "Description":"Veterinary professionals are fortunate in that we have a wealth of career opportunities open to us across        the nation. So how do we decide where to work?        There are many factors to consider, both tangible and intangible. One rich source of tangible metrics is the cost-of-living index.                This measurement tells us how much, on average, it costs to live in a given location, relative to other locations. It takes into account expenses like housing,         groceries, utilities, transportation, health care, and miscellaneous goods and services. "        ,
        "Content":"What the data show,  As today’s chart shows, the cost-of-living index varies widely among states.     Average cost of living by state, July 2023        About two dozen states have cost-of-living values lower than the national average, with Mississippi ranking lowest,         at approximately 18% below the national average in 2023.                When it comes to above-average cost of living, there’s more of a spread. In fact, five locations (Alaska, California,         Hawaii, Massachusetts, and the District of Columbia) have cost-of-living values at least 21% higher than the national          average. D.C. tops the list at about 50% above average.                What does this mean?        When exploring job options—or working to recruit and retain team members as an employer—cost of living is important to         consider. This is because the same compensation has different purchasing power and supports a different standard of living         , depending on where you are. For instance, a salary that might be considered low in Massachusetts could support quite a          comfortable standard of living in Mississippi.                 State-by-state comparisons are only a starting point, though. The cost of living often varies widely within states or regions,         so a more granular view is needed for job decisions. That’s why the AVMA recently released a new tool that gives veterinary          professionals easy access to cost-of-living data and more.                Enter AVMA JobFIT        Ready to explore cost of living in greater detail? No need to leave your seat. AVMA JobFIT allows job seekers, employers,         retirement planners, and other curious minds to explore what it would be like to live and/or work in various places across         the United States. Found in the AVMA Veterinary Career Center, this free tool pulls together information on thousands of          communities and displays it in map form at the county-by-county level.                With JobFIT, you can effortlessly visualize what life might be like in a specific area, financially speaking. Find summary         data on cost of living, housing costs, and monthly rent, overlaid with veterinary job opportunities for easy reference. ",
        "ImageUrl": "/7.jpg",
        "UserId": 7 
    },
    {
        "Title": "Two new resources support equine veterinary practices",
        "Description":"Equine veterinarians and veterinary teams can leverage new tools to improve client communication         and inform business and career planning—thanks to a partnership between the AVMA and the American Association of          Equine Practitioners (AAEP).        Released earlier this month in celebration of World Horse Day, both the Effective Equine Care Guide and the Economic State of the Equine Veterinary Profession Report were developed jointly by the AVMA and AAEP.",
        "Content":"Prevent conflict; build healthy client partnerships        Healthy relationships and communication between veterinary teams and clients are essential to great patient care, as well as the personal wellbeing of veterinary care team members.                By setting out clear expectations on both sides, it can strengthen your practice’s partnership with horse owners, and ultimately help you provide the best possible patient care.                 The new Effective Equine Care Guide provides a framework for equine veterinarians to align expectations, support strong client communication, and prevent conflict. It’s a comprehensive, one-page resource that outlines matching expectations for both veterinary teams and clients.                 By setting out clear expectations on both sides, it can strengthen your practice’s partnership with horse owners, and ultimately help you provide the best possible patient care.                 You can download the guide for free at any time as part of the AVMA’s free toolkit of reputation resources. Along with the guide, you’ll find tips for introducing it to your team and clients and for responding to unmet expectations.                        The guide was inspired by the Positive Pet Care Guide, a similar tool for companion animal practices.                 New data to inform business and career decisions        The 2024 Economic State of the Equine Veterinary Profession Report provides a detailed look at the current economics of equine medicine, highlighting key trends related to labor markets, compensation, debt, satisfaction, practice characteristics, and more. Based on surveys conducted in both 2022 and 2023, it’s an indispensable resource for anyone interested in equine medicine.                 The Economic State of the Equine Veterinary Profession Report is available for free to AVMA members and can be purchased by all others in the AVMA Store. Get the report here." 
        ,"ImageUrl": "/8.jpg",
        "UserId": 8 
    },
    {
        "Title": "Celebrating Women’s History Month and our amazing profession",
        "Description": "Social media event stems from AVMA partnership",
        "Content":"March marks Women’s History Month, a time for me to reflect on the women who paved the way for me and         so many of my veterinary colleagues in this noble profession.        I celebrate the achievements and accomplishments of those who had a much tougher path than I did, and I share my         gratitude for the women who came before me and those I meet today who continue to inspire me. I have often thought,          “How did I get lucky enough to be part of this amazing profession and call all of these amazing people my colleagues?”                 This profession has been very good to me, thanks in no small part to the women who have broken barriers and paved         the way for all of us. These influential women have contributed immensely as clinicians, specialists, researchers,         educators, public health officials, and business owners.  " ,
        "ImageUrl": "/9.jpg",
        "UserId": 1 
    },
    {
        "Title": "Curiosity can lead to discovery: Embracing neurodiversity",
        "Description": "Diversity is everywhere—and we can’t always see it.",
        "Content":"A new learning module from Journey for Teams thoughtfully delves into the diversity of brain functions,         highlighting the distinct benefits and strengths these variations contribute to our collective experiences.        Neurodiversity: Foster an Extraordinary Workplace encourages us to “lead with curiosity” when we meet people who are different         from us, rather than view differences as disabilities. It also breaks down some common misconceptions about specific types         of neurodivergence. Among the discoveries it offers:                Individuals with dyslexia typically have very high visual/spatial skills, which can be a great strength, especially in         contexts like surgery.        Strengths of people with Attention-Deficit/Hyperactivity Disorder (ADHD) include creativity and innovative problem solving.        The module also offers practical tips to make veterinary practices more welcoming to people who are neurodivergent—from         reviewing intake forms and job descriptions, to adjusting lighting, sound, and equipment settings to creating a more          sensory-friendly environment.               Everyone’s brain is unique. The way we see and interpret the world differs from person to person. The new Journey for         Teams module shows how those differences are not deficits, and helps learners discover ways to discover and bring out         everyone’s strengths. ",
        "ImageUrl": "/10.jpg", 
         "UserId": 9 
    },
    {
        "Title": "Pet food safety: Resources to keep patients and clients safe",
        "Description": "Social media event stems from AVMA partnership",
        "Content":"When pet foods and treats are recalled due to bacterial or other contamination, pet owners may have questions         and concerns they bring to the veterinary team. Resources on the AVMA website can help you answer these questions,          including a new webpage that outlines best practices for safely handling pet food and treats.        New resource: Keep animals and people safe        Animal food and treat recalls provide an important reminder about the importance of handling food and treats safely.         Owners don’t always realize that their pet’s food and treats—just like people’s food—need to be handled carefully to         avoid potential contamination and illness in both pets and people.                 That’s why the AVMA now has a webpage you can use to help clients understand how to safely handle pet food and treats.                 The page explains both the how and why of handling food and treats, from hand washing and when to dispose of products,         to which groups of people are most at risk of illness from potential bacterial exposures.                The next time you hear or read a news report about recalled pet food products, share this webpage with your clients and         your team. Help spread the word to keep both animals and people safe.                What products have been recalled—and why?        Did you know that the AVMA also tracks and provides information about animal-related product recalls and safety alerts,         including animal foods or feeds and pet treats? They’re all in a searchable list at avma.org/Recalls. You can search by          product name or keyword, sort alphabetically or by recall date, and filter the list to show only food or non-food alerts.                This practical resource can help both you and your clients stay informed about recalls and safety issues on an ongoing basis.        And the list goes back several years, so you also can check on older products.                To learn about new recalls in real time, follow the AVMA on social media, including @AVMARecallWatch on X, formerly known as         Twitter. " 
        ,"ImageUrl": "/12.jpg",
        "UserId": 10 
    },
    {
        "Title": "Elevate your leadership style: New webinars on AVMA Axon",
        "Description": "Social media event stems from AVMA partnership",
        "Content":"Build skills that will help you as a leader, mentor, colleague, and coach with a set of four new CE webinars         in the AVMA Axon® learning library.        The webinars provide on-demand access to some of the most popular sessions presented at the AVMA’s 2024 Veterinary Leadership         Conference in January. Choose from the following courses:                Emotional intelligence in a digital world        Emotional intelligence plays a critical role in improving patient care and practice success. Discover nuances of emotional         intelligence in digital settings, including best practices for building trust and rapport, providing personalized care,          and managing client emotions in our connected world.                 Science of coaching: Inspire learning and change       An effective coaching relationship involves a deep emotional connection. Professor Richard Boyatzis, PhD, digs into the         science behind different approaches to coaching. Uncover the techniques that are most effective in bringing about sustainable          change and learning.                 Elevate your meetings: Inspire, interact, engage        Learn how to facilitate the kinds of meetings that make people feel inspired and engaged—meetings that are dynamic and         energizing, filled with robust discussion and positive outcomes.                Two influencers you need on your leadership team        There are two key people that most leaders never even consider having on their team. In this session, you'll find out         who they are and how they can help you influence the direction of your organization, even if you’re not the person in         charge.                 Find all four webinars in the Best of Veterinary Leadership Conference 2024 series on AVMA Axon®. " ,
        "ImageUrl": "/13.jpg",     
        "UserId": 11 
    },
    {
        "Title": "Introducing: Your new and improved clinical studies registry",
        "Description": "Enhancements include new features for scientists, veterinarians, and clients",
        "Content":"Explore AVMA’s new Veterinary Clinical Trials Registry—formerly the AVMA Animal Health Studies Database.         As a tool that connects pet owners and veterinarians with veterinary clinical trials, the registry helps advance          the practice of veterinary medicine and accelerate improvements in animal health care.        The registry is designed to help you and your clients search for and find suitable studies for patients. It’s easy        for anyone to use, and there’s no sign-up required to search for studies. Just enter keywords or filter by a variety         of criteria. For example, see studies recruiting canine subjects or studies investigating cancer. Animal owners interested         in participating in a clinical trial are encouraged to first discuss their animal's eligibility with their own veterinarian.                The Veterinary Clinical Trials Registry improves upon several features of the previous database:                Offers a more approachable look and feel        Makes browsing and sharing studies easy        Provides a variety of ways to search for specific studies        Notifies users when relevant studies are published        Encourages sharing of study results and conclusions       Streamlines the study submission process for study personnel and curators " ,
        "ImageUrl": "/14.jpg",
        "UserId": 12 
    },
    {
        "Title": "Learning from every generation",
        "Description": "Social media event stems from AVMA partnership",
        "Content":" How can you embrace generational diversity at your workplace and treat everyone as an individual          while still appreciating the qualities each generation brings to the table?        In what ways do generational differences play a role in workplace communication?                Explore these questions and more in a new educational module released by Journey for Teams: Generational Diversity,         now available on the Journey for Teams website.               Featuring a short video and written topic and discussion guides, this module provides practical information to help         you understand, welcome, and learn from people in every generation. Among the topics it covers:                What are the five generations represented in current workplaces?        What traits are common within members of these generations?        How do their communication preferences differ?        How can generational diversity benefit your workplace?        Every generation has something to teach and something to learn. See what embracing generational diversity could mean to         your workplace. Watch Generational Diversity now, and share it with your colleagues. " ,
        "ImageUrl": "/15.jpg",
        "UserId": 9 
    }
]